heat-sim-freecad/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    patch_0_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          336;
        startFace       111003;
    }
    patch_1_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10878;
        startFace       111339;
    }
    patch_2_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          204;
        startFace       122217;
    }
    patch_3_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       122421;
    }
    patch_4_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          256;
        startFace       122661;
    }
    patch_5_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          256;
        startFace       122917;
    }
)

// ************************************************************************* //
