heat-sim-freecad/system/BlenderMeshes/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/basta/Documents/bakalarka/bakalarka-openfoam/heat-sim-heaters/model.blend
// Export date: 2024-10-23 23:31:51.561743

scale 1;

vertices
(
    ( -21 -21 -6 )
    ( 21 -21 -6 )
    ( 21 21 -6 )
    ( -21 21 -6 )
    ( -21 -21 6 )
    ( 21 -21 6 ) 
    ( 21 21 6 ) 
    ( -21 21 6 ) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 42 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
